[
  {
    "id": "1",
    "link": "https://pdx.scholarshipuniverse.com/student/scholarship/206515",
    "title": "Sheldon Maron Endowed Scholarship",
    "info": "The Sheldon Maron Endowed Scholarship supports graduate students in the special education program.",
    "time": "11/01/2022-04/01/2023",
    "amount": "Varies",
    "org": "College of Education"
  },
  {
    "id": "2",
    "link": "https://pdx.scholarshipuniverse.com/student/scholarship/206517",
    "title": "College of Education Pathways for Diverse Educators",
    "info": "College of Education Pathways for Diverse Educators Scholarship supports underrepresented and culturally diverse future educators.",
    "time": "11/01/2022-04/01/2023",
    "amount": "varies",
    "org": "College of Education"
  },
  {
    "id": "3",
    "link": "https://pdx.scholarshipuniverse.com/student/scholarship/206518",
    "title": "Thieman Access and Diversity in Social Studies",
    "info": "Scholarship for exemplary graduate students in the COE Teacher Preparation Program with demonstrated financial need and potential for becoming a great K-12 classroom teacher. Preference will be given to students pursuing an initial secondary teaching license in the social sciences, who are committed to the advancement of social justice and diversity, equity and inclusion in schools, who have multicultural experience, and intend to teach in a high need or challenging school setting.",
    "time": "11/01/2022-04/01/2023",
    "amount": "varies",
    "org": "College of Education"
  },
  {
    "id": "4",
    "link": "https://pdx.scholarshipuniverse.com/student/scholarship/206540",
    "title": "Elva Coombs Endowed Scholarship",
    "info": "The Elva Coombs Endowed Scholarship supports graduate students in the College of Education. Applicants must be preparing to teach physical education or preparing to work with injury evaluation, treatment, and rehabilitation for the physically active. There must be demonstrated financial need.",
    "time": "11/01/2022-04/01/2023",
    "amount": "varies",
    "org": "College of Education"
  },
  {
    "id": "5",
    "link": "https://pdx.scholarshipuniverse.com/student/scholarship/206547",
    "title": "College of Education Scholarship",
    "info": "The College of Education Scholarship is available for graduate students.",
    "time": "11/01/2022-04/01/2023",
    "amount": "varies",
    "org": "College of Education"
  },
  {
    "id": "6",
    "link": "https://pdx.scholarshipuniverse.com/student/scholarship/219245",
    "title": "Freedom From Religion Foundation (FFRF): Brian Bolton Essay Contest",
    "info": "The competition is generously endowed by Brian Bolton, an FFRF Lifetime Member who is a retired psychologist, humanist minister and university professor emeritus at the University of Arkansas.",
    "time": "10/01/2022-03/15/2023",
    "amount": "varies",
    "org": "External Scholarship"
  },
  {
    "id": "7",
    "link": "https://pdx.scholarshipuniverse.com/student/scholarship/218266",
    "title": "Pinnacle Project Management Scholarship",
    "info": "Project Management is an ever-evolving field that must be open to innovative ideas and new ways of ensuring project success. What works today will not necessarily work in the future, so project management is always in need of new voices to help us understand the current landscape. Pinnacle is committed to promoting the future of project management by helping future project professionals.",
    "time": "11/30/2022-03/31/2023",
    "amount": "500",
    "org": "External Scholarship"
  },
  {
    "id": "8",
    "link": "https://pdx.scholarshipuniverse.com/student/scholarship/197144",
    "title": "BeArt-Presets Academic Scholarship",
    "info": "BeArt-Presets is pleased to announce the  Academic Scholarship program. In BeArt-Presets they recognise the importance of education and the role it plays in personal and professional fulfilment. Students work hard to earn top marks, dreaming of the education they will receive and the college they'll attend. Unfortunately, many of these students won’t be able to afford it. That's why they want to help these students to attain their educational goals and reach their full potential. Each year, BeArt-Presets offers a $2000 scholarship to one talented student.",
    "time": "04/01/2022-04/01/2023",
    "amount": "2000",
    "org": "External Scholarship"
  }
]
